lululu-913/F280049_AC-DC-AC_26competition/controller.c
volatile int rectifier_enable = 0;                                          // 整流独立模式命令：0被动整流、1主动整流
volatile int inverter_enable = 0;                                           // 逆变独立模式命令：0请求关断、1请求运行
int rectifier_enable_last = 0;                                              // 保存上一拍整流命令以检测KEY3切换边沿
int inverter_enable_last = 0;                                               // 保存上一拍逆变命令以检测KEY6切换边沿
volatile int tag = 0;                                                       // 仅供在线观察的组合状态位：bit1整流、bit0逆变
int inverter_pwm_start_stage = 0;                                           // 逆变PWM启动阶段：0关断、1预装、2待释放、3正常运行
Uint16 inverter_pwm_release_wait = 0U;                                      // 逆变CMPA预装后的控制ISR等待计数
int rectifier_pwm_start_stage = 0;                                          // 整流PWM启动阶段：0关断、1预装、2待释放、3正常运行
Uint16 rectifier_pwm_release_wait = 0U;                                     // 整流CMPA预装后的20kHz控制ISR等待计数
int inverter_soft_stop_active = 0;                                          // 逆变软关断状态：1时逐步把调制幅值降为零
float inverter_soft_gain = 0.0f;                                            // 逆变三相正弦幅值系数：0完全降幅、1正常输出
volatile int rectifier_fault = 0;                                           // 整流局部故障锁存，不直接关断逆变侧
volatile int system_fault = 0;                                              // 预留的全局故障锁存；母线过压不再置位该标志
Uint16 bus_overvoltage_count = 0U;                                          // 母线连续超压采样计数，任一正常采样立即清零
Uint16 input_overcurrent_count = 0U;                                        // 主动整流连续过流采样计数，任一正常采样立即清零
int oled_row = 0;                                                           // 保存下一次需要刷新的OLED行号
int N_oled = 0;                                                             // OLED刷新请求的20kHz分频计数器
volatile int oled_refresh_request = 1;                                      // OLED按行刷新请求标志，上电后先请求刷新第0行
int N = 200;                                                                // 10ms统计窗口长度，与三相输出频率相互独立
float sum1 = 0;                                                             // 保存母线平均值累加
int N_c1 = 0, N_c2 = 0;                                                     // 分别作为整流母线窗口和逆变输出窗口计数器
float M = INVERTER_MODULATION_DIVISOR_INITIAL;                             // 逆变电压环调制分母从集中宏读取上电初值
volatile int flag = 0;                                                      // 保护原因标志，由控制ISR写入并由主循环显示

float U_oa = 0, U_ob = 0, U_oc = 0;                                         // 重构得到的三相输出相电压
float U_oab = 0, U_obc = 0;                                                 // 三相输出线电压变量
float theta_a = 0, theta_b = 0, theta_c = 0;                                // 三相SPWM参考相位
float Da = 0.4, Db = 0.4, Dc = 0.4;                                         // 保留的三相占空比变量
float U_bus = 0;                                                            // 直流母线瞬时采样值
float U_av = 0;                                                             // 由三相相电压计算的瞬时等效有效值
float output_common_sq_sample = 0.0f;                                       // 三相相电压平方平均的瞬时样本
float output_common_sq_f = 0.0f;                                            // 三相公共有效值平方的快速IIR状态
float output_phase_a_sq_f = 0.0f;                                           // A相有效值平方的慢速IIR状态
float output_phase_b_sq_f = 0.0f;                                           // B相有效值平方的慢速IIR状态
float output_phase_c_sq_f = 0.0f;                                           // C相有效值平方的慢速IIR状态
volatile float U_oa_rms = 0.0f;                                             // 滤波后的A相有效值
volatile float U_ob_rms = 0.0f;                                             // 滤波后的B相有效值
volatile float U_oc_rms = 0.0f;                                             // 滤波后的C相有效值
float U_phase_avg = 0.0f;                                                   // 三相有效值平均，用作独立补偿公共基准
float U_bus_ff = 55.0f;                                                     // 逆变瞬时母线前馈滤波状态从额定母线值开始
float bus_feedforward_gain = 1.0f;                                          // 母线参考值与实时母线值之比
float inverter_modulation = 0.0f;                                           // 经母线前馈和总限幅后的公共调制度
float modulation_a = 0.0f, modulation_b = 0.0f, modulation_c = 0.0f;        // 叠加相间平衡补偿后的三相调制度
float phase_trim_a = 0.0f, phase_trim_b = 0.0f, phase_trim_c = 0.0f;         // 三相零和幅值补偿系数
Uint16 phase_balance_settle_windows = 0U;                                   // 满幅运行后的平衡控制等待计数

float U_in = 0;                                                             // 输入电压
float I_in = 0;                                                             // 输入电流
volatile float U_bus_rms = 0;                                               // 直流母线10ms平均值，由控制ISR更新并由主循环显示
volatile float U_out_rms = 0;                                               // 三相交流输出窗口有效值，由控制ISR更新并由主循环显示
float pid_out = 0;                                                          // 母线电压外环累计得到的输入电流正峰值
float pll_out = 0;                                                          // 乘入PLL相位后的电流参考值
float D1 = 0.5f;                                                            // 整流左桥臂占空比，右桥臂使用1-D1
float middle = 0;                                                           // 输入电流内环补偿量及桥臂参考电压中间变量
volatile float I_ref_mag = 0.0f;                                            // 母线电压外环给出的带符号电流峰值，保留原有负幅值约定
float i_l_ref = 0.0f;                                                       // 整流电感与输入电压同相的瞬时电流参考
float err_i = 0.0f;                                                         // 比例电流环的瞬时跟踪误差
float u_i_out = 0.0f;                                                       // 比例电流控制器输出电压补偿量
float i_ctrl = 0.0f;                                                        // 电流补偿与输入电压前馈合成的桥侧电压指令
volatile float Di = 0.0f;                                                   // ISR更新的单极性整流调制量，后台OLED读取其快照
float v_dc_bus = 5.0f;                                                      // 单极性调制归一化使用的实时母线电压（功率减半）

//************* 锁相环参数 *************//
float W0 = 314.159f;                                                        // 50Hz额定角频率100π
float W1 = 314.159f;                                                        // PLL估算角频率，初值为50Hz
float W1_pi = 0.0f;                                                        // PLL估算频率的Hz显示量
float Ts = 0.00005f;                                                        // PLL采样周期为50微秒，对应20kHz控制中断
float k = 1.0f;                                                             // SOGI传递函数比例系数
float x = 0.0f;                                                             // 输入电压与SOGI α轴输出的瞬时误差
float Ua = 0.0f;                                                            // SOGI生成的α轴正交分量
float Ub = 0.0f;                                                            // SOGI生成的β轴正交分量
float Ud = 0.0f;                                                            // PLL同步旋转坐标系d轴分量
float Uq = 0.0f;                                                            // PLL同步旋转坐标系q轴分量
float theta = 0.0f;                                                         // PLL输出电角度
float kp = 100.0f;                                                          // 20kHz采样下的PLL每拍积分增量系数
float ki = 10.0f;                                                           // PLL误差差分项系数与采样周期无关，保持不变
float err = 0.0f;                                                           // PLL当前q轴误差
float last_err = 0.0f;                                                      // PLL上一拍q轴误差
float result = 0.0f;                                                        // PLL本拍角频率修正增量

//******************* 主函数 *******************//
void main(void)                                                             // 程序入口，完成F280049外设和控制器初始化
{
#ifdef _FLASH                                                               // 仅在Flash构建时启用RAM函数段复制
    memcpy(&RamfuncsRunStart, &RamfuncsLoadStart, (size_t)&RamfuncsLoadSize); // 把需在RAM执行的函数段从Flash复制到RAM
#endif                                                                      // 结束条件编译

