lululu-913/F280049_AC-DC-AC_26competition/controller.c
    AdcbRegs.ADCBURSTCTL.all = 0;                                           // 关闭ADCB突发转换，确保B0仅由配置的SOCA触发
    AdcbRegs.ADCSOCPRICTL.all = 0;                                          // 恢复ADCB默认轮询优先级
    AdcbRegs.ADCINTSOCSEL1.all = 0;                                         // 禁止ADCB ADCINT1～4再次触发SOC0～7
    AdcbRegs.ADCINTSOCSEL2.all = 0;                                         // 禁止ADCB ADCINT1～4再次触发SOC8～15
    AdcbRegs.ADCSOCOVFCLR1.all = 0xFFFF;                                    // 清除ADCB全部SOC触发溢出粘滞标志
    AdcbRegs.ADCINTOVFCLR.all = 0x000F;                                     // 清除ADCB全部ADC中断溢出标志
    AdcbRegs.ADCINTFLGCLR.all = 0x000F;                                     // 清除ADCB全部ADC中断标志

    // 将F28069的SOC/通道关系分别映射到F280049的ADCA和ADCB。
    AdcaRegs.ADCSOC0CTL.bit.CHSEL = 0;                                      // SOC0选择ADCINA0，采集输入电压U_in
    AdcaRegs.ADCSOC0CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC0CTL.bit.TRIGSEL = 9;                                     // 选择ePWM3 SOCA作为20kHz硬件触发源

    AdcaRegs.ADCSOC1CTL.bit.CHSEL = 1;                                      // SOC1选择ADCINA1，采集母线电压U_bus
    AdcaRegs.ADCSOC1CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC1CTL.bit.TRIGSEL = 9;                                     // 选择ePWM3 SOCA作为20kHz硬件触发源

    AdcaRegs.ADCSOC2CTL.bit.CHSEL = 2;                                      // SOC2选择ADCINA2，采集输出线电压U_oab
    AdcaRegs.ADCSOC2CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC2CTL.bit.TRIGSEL = 9;                                     // 选择ePWM3 SOCA作为20kHz硬件触发源

    AdcaRegs.ADCSOC3CTL.bit.CHSEL = 3;                                       // SOC3选择ADCINA3，采集输出线电压U_obc
    AdcaRegs.ADCSOC3CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcaRegs.ADCSOC3CTL.bit.TRIGSEL = 9;                                     // 选择ePWM3 SOCA作为20kHz硬件触发源

    AdcbRegs.ADCSOC0CTL.bit.CHSEL = 0;                                      // SOC0选择ADCINB0，采集输入电流I_in
    AdcbRegs.ADCSOC0CTL.bit.ACQPS = 9;                                      // 设置ADC采样保持窗口为10个SYSCLK
    AdcbRegs.ADCSOC0CTL.bit.TRIGSEL = 9;                                     // 选择ePWM3 SOCA作为20kHz硬件触发源

    // 逆变侧采用纯电压环，因此不再配置ADCB1～3三相电流采样。
    // EOC3是最后一个使用的ADCA结果，此时并行转换的ADCB RESULT0早已完成。
    AdcaRegs.ADCINTSEL1N2.bit.INT1SEL = 3;                                  // 选择ADCA EOC3作为ADCINT1中断源
    AdcaRegs.ADCINTSEL1N2.bit.INT1E = 1;                                    // 使能ADCA INT1中断输出
    AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;                                  // 清除ADCA INT1标志以允许下一次中断

    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

//******************* ADC中断（20kHz控制核心）*******************//
__interrupt void adcA1ISR(void)                                             // 20kHz ADC中断与全部实时控制算法
{
    U_in = ((float)AdcaResultRegs.ADCRESULT0 - 2055.2f) / 36.274f;            // 按y=36.443x+2066.2将ADCINA0原始值反算为输入电压
    U_bus = ((float)AdcaResultRegs.ADCRESULT1 - 2060.1f) / 22.44f;           // 按y=26.268x+2067.9将ADCINA1原始值反算为母线电压
    U_oab = ((float)AdcaResultRegs.ADCRESULT2 - 2039.8) / 36.305f;           // 按y=36.353x+2066.7将ADCINA2原始值反算为输出线电压Uab
    U_obc = ((float)AdcaResultRegs.ADCRESULT3 - 2057.9f) / 26.344f;           // 按y=36.169x+2067.9将ADCINA3原始值反算为输出线电压Ubc
    I_in = ((float)AdcbResultRegs.ADCRESULT0 - 1847.6f) / 159.45f;            // 按y=164.61x+2077.3将ADCINB0原始值反算为输入电流

    if((system_fault == 0) &&                                               // 已有全局故障时不再用局部故障覆盖OLED故障码
       (rectifier_pwm_start_stage == 3) &&                                  // 仅主动整流PWM正式运行后启用F1，忽略二极管预充浪涌
       (fabsf(I_in) > INPUT_OVERCURRENT_LIMIT))                             // 检测输入瞬时电流是否超过9A软件保护阈值
    {
        if(input_overcurrent_count < INPUT_OVERCURRENT_CONFIRM_SAMPLES)     // 饱和计数避免连续过流时变量回绕
            input_overcurrent_count++;
    }
    else                                                                    // 正常电流或整流尚未运行时立即打断连续确认
    {
        input_overcurrent_count = 0U;
    }
    if(input_overcurrent_count >= INPUT_OVERCURRENT_CONFIRM_SAMPLES)        // 第3个连续过流样本确认F1，最迟约150us
    {
        rectifier_enable = 0;                                               // 整流过流只撤销主动整流命令，不直接改变逆变运行命令
        rectifier_fault = 1;                                                // 锁存整流局部故障，等待KEY3重新确认启动
        rectifier_pwm_start_stage = 0;                                      // 清零整流PWM启动阶段
        PWM_TripRectifier();                                                // 立即Trip ePWM4/5并退回MOSFET体二极管被动整流
        flag = 1;                                                           // 记录输入过流故障
    }
    if(U_bus >= BUS_OVERVOLTAGE_LIMIT)                                      // 超过77V时累计连续超压样本
    {
        if(bus_overvoltage_count < BUS_OVERVOLTAGE_CONFIRM_SAMPLES)         // 饱和计数避免长时间超压时变量回绕
            bus_overvoltage_count++;
    }
    else                                                                    // 任一正常母线样本立即打断连续超压确认
    {
        bus_overvoltage_count = 0U;
    }
    if(bus_overvoltage_count >= BUS_OVERVOLTAGE_CONFIRM_SAMPLES)            // 连续超压2ms后才确认真实母线过压
    {
        rectifier_enable = 0;                                               // 母线过压时撤销主动整流运行命令
        rectifier_fault = 1;                                                // 将母线过压锁存为整流侧局部故障
        rectifier_pwm_start_stage = 0;                                      // 清零整流PWM启动阶段
        PWM_TripRectifier();                                                // 只Trip ePWM4/5，保持逆变ePWM1～3继续运行
        flag = 2;                                                           // 记录母线过压故障并由OLED显示F2
    }
    if(system_fault != 0)                                                   // 全局故障锁存期间始终保持全部功率级关断
    {
        rectifier_enable = 0;                                               // 禁止全局故障期间重新运行主动整流
        inverter_enable = 0;                                                // 禁止全局故障期间重新运行逆变
        PWM_ForceAllLow();                                                   // 每拍保持全部One-Shot Trip锁存
    }

