lululu-913/F280049_AC-DC-AC_26competition/controller.c
    PLL1(U_in);                                                             // 停机时也持续锁相，使启动前PLL已经跟踪输入电压

    U_ob = (U_obc - U_oab) * 0.3333f;                                       // 由Uab、Ubc重构B相相电压
    U_oa = U_ob + U_oab;                                                    // 由B相相电压和Uab重构A相相电压
    U_oc = -(U_ob + U_oa);                                                  // 利用三相电压和为零重构C相相电压
    U_av = sqrtf((U_oa * U_oa + U_ob * U_ob + U_oc * U_oc) * 0.3333f);      // 计算三相瞬时等效有效值
    output_common_sq_sample = (U_oa * U_oa + U_ob * U_ob + U_oc * U_oc) *   // 平衡三相时该量不含2倍输出频率脉动
                              0.3333333f;
    output_common_sq_f += OUTPUT_COMMON_IIR_ALPHA *                         // 快速滤波公共三相幅值供总电压环使用
                          (output_common_sq_sample - output_common_sq_f);
    output_phase_a_sq_f += OUTPUT_PHASE_IIR_ALPHA *                         // 慢速滤波各相平方以抑制单相2倍频脉动
                           (U_oa * U_oa - output_phase_a_sq_f);
    output_phase_b_sq_f += OUTPUT_PHASE_IIR_ALPHA *
                           (U_ob * U_ob - output_phase_b_sq_f);
    output_phase_c_sq_f += OUTPUT_PHASE_IIR_ALPHA *
                           (U_oc * U_oc - output_phase_c_sq_f);

    if(U_bus > BUS_CONTROL_MIN_VOLTAGE)                                     // 母线有效时跟踪瞬时母线纹波
    {
        U_bus_ff += BUS_FEEDFORWARD_IIR_ALPHA * (U_bus - U_bus_ff);
    }
    else                                                                    // 欠压或采样异常时回到参考值，避免除零与突增
    {
        U_bus_ff = U_BUS_REF;
    }

    if(rectifier_enable != rectifier_enable_last)                           // 检测KEY3产生的主动整流独立模式切换
    {
        if(rectifier_enable != 0)                                           // KEY3请求启动主动整流
        {
            PWM_TripRectifier();                                            // 启动前保持ePWM4/5的Trip Zone关断锁存
            rectifier_pwm_start_stage = 0;                                  // 等待逆变ePWM1～3先进入正常运行阶段再启动整流
            pid_out = 0.0f;                                                 // 从零开始建立外环电流幅值，避免沿用开环测试给定
            I_ref_mag = 0.0f;                                               // 整流启动前把瞬时电流参考幅值清零
            pid1.Err = 0.0f;                                                // 清零母线外环当前误差
            pid1.Err_last = 0.0f;                                           // 清零母线外环上一拍误差，防止切换冲击
            pid1.result = 0.0f;                                             // 清零母线外环本拍电流增量
            rectifier_fault = 0;                                            // 用户重新开启时清除整流局部故障锁存
            if(flag == 1) flag = 0;                                         // 仅清除对应的整流过流显示
        }
        else                                                                // KEY3请求停止主动整流
        {
            PWM_TripRectifier();                                            // 只关断ePWM4/5，逆变侧继续根据自身命令和母线运行
            rectifier_pwm_start_stage = 0;                                  // 下次启动必须重新完成CMPA预装流程
            pid_out = 0.0f;                                                 // 清零母线外环累计电流幅值
            I_ref_mag = 0.0f;                                               // 清零整流瞬时电流参考幅值
        }
    }
    rectifier_enable_last = rectifier_enable;                               // 保存当前整流命令供下一拍检测边沿

    if(inverter_enable != inverter_enable_last)                             // 检测KEY6产生的逆变独立模式切换
    {
        if(inverter_enable != 0)                                            // KEY6请求启动逆变
        {
            inverter_soft_stop_active = 0;                                  // 新的运行请求取消普通软关断状态
        }
        else if((inverter_pwm_start_stage == 3) && (inverter_soft_gain > 0.0f)) // 运行中的逆变收到KEY6关闭命令
        {
            inverter_soft_stop_active = 1;                                  // 保持PWM工作并开始按10ms节拍降低输出幅值
        }
        else                                                                // 尚未正常输出时收到关闭命令
        {
            PWM_TripInverter();                                             // 无需等待软斜坡，直接保持逆变Trip关断
            inverter_pwm_start_stage = 0;                                   // 清零逆变启动阶段
            inverter_soft_gain = 0.0f;                                      // 清零逆变输出幅值
        }
    }
    inverter_enable_last = inverter_enable;                                 // 保存当前逆变命令供下一拍检测边沿

    if((inverter_enable != 0) && (inverter_pwm_start_stage == 0) &&          // 逆变命令开启且PWM尚未启动
       (system_fault == 0))                                                 // 不再使用母线欠压作为逆变启动限制
    {
        PWM_TripInverter();                                                 // 自动重启前再次确认ePWM1～3保持Trip关断
        inverter_pwm_start_stage = 1;                                       // 进入逆变CMPA预装阶段
        inverter_soft_gain = 0.0f;                                          // 每次启动均从零输出幅值开始
        inverter_soft_stop_active = 0;                                      // 清除旧软关断状态
        pida.Err = 0.0f;                                                    // 清零逆变电压环当前误差
        pida.Err_last = 0.0f;                                               // 清零逆变电压环上一拍误差
        pida.result = 0.0f;                                                 // 清零逆变电压环本拍增量
    }

    if((rectifier_enable != 0) && (rectifier_fault == 0) &&                 // 存在主动整流运行请求且整流侧无故障
       (system_fault == 0) && (rectifier_pwm_start_stage == 0) &&           // 整流PWM尚未开始启动
       (inverter_pwm_start_stage == 3))                                     // 必须确认逆变ePWM1～3已经先安全释放
    {
        PWM_TripRectifier();                                                // 预装整流比较值前继续保持ePWM4/5关断
        rectifier_pwm_start_stage = 1;                                      // 逆变已运行后才允许进入整流PWM预装阶段
    }

    N_c1++;                                                                 // 独立累加母线10ms平均值窗口，不再依赖逆变是否运行
    sum1 += U_bus;                                                          // 累加母线瞬时采样供整流外环使用
    if(N_c1 >= N)                                                           // 母线统计窗口达到200个20kHz采样点
    {
        N_c1 = 0;                                                           // 清零母线统计窗口计数
        U_bus_rms = sum1 / N;                                               // 更新母线10ms平均值
        sum1 = 0.0f;                                                        // 清零母线累加器
        if((rectifier_enable != 0) && (rectifier_fault == 0) &&             // 仅主动整流正常请求下更新母线电压外环
           (system_fault == 0))
        {
            pid1.ref = U_BUS_REF;                                           // 读取独立的母线电压目标值
            pid1.result = PID1_Cal(U_bus_rms);                              // 以100Hz更新母线外环电流幅值增量
            if(pid1.result > BUS_CURRENT_SLEW_UP_STEP)                      // 限制正向电流幅值变化率
                pid1.result = BUS_CURRENT_SLEW_UP_STEP;                     // 启动或输入电压降低时约以1.0A/s增加
            else if(pid1.result < -BUS_CURRENT_SLEW_DOWN_STEP)              // 单独限制反向电流幅值变化率
                pid1.result = -BUS_CURRENT_SLEW_DOWN_STEP;                  // 负载减小时约以2.0A/s降低
            pid_out += pid1.result;                                         // 累计得到有功输入电流峰值参考
            if(pid_out > INPUT_CURRENT_PK_MAX) pid_out = INPUT_CURRENT_PK_MAX; // 将母线外环电流峰值参考限制在6A
            if(pid_out < 0.0f) pid_out = 0.0f;                              // PFC仅允许交流侧向直流母线传递有功功率
            I_ref_mag = -pid_out;                                           // 转换为当前PLL相位方向所需的负幅值约定
        }
    }

    if((rectifier_enable != 0) && (rectifier_fault == 0) &&                 // 主动整流命令与局部保护均允许输出
       (system_fault == 0) && (rectifier_pwm_start_stage != 0))             // 已进入整流PWM预装或正常运行阶段
    {
        i_l_ref = I_ref_mag * cosf(theta);                                  // 生成与输入电压同相的瞬时电流参考
        pll_out = i_l_ref;                                                  // 同步旧变量供在线观察瞬时电流参考
        pid2.ref = i_l_ref;                                                 // 逐拍更新输入电流比例控制器参考值
        u_i_out = PID2_Cal(I_in);                                           // 通过PID2统一计算比例电流补偿电压
        err_i = pid2.Err;                                                   // 同步PID2误差供在线观察
        if(u_i_out > CURRENT_CTRL_VOLTAGE_LIMIT)                             // 限制正向电流补偿电压
            u_i_out = CURRENT_CTRL_VOLTAGE_LIMIT;                           // 防止大电流误差直接把调制量推入饱和
        else if(u_i_out < -CURRENT_CTRL_VOLTAGE_LIMIT)                       // 限制反向电流补偿电压
            u_i_out = -CURRENT_CTRL_VOLTAGE_LIMIT;                          // 保持电流补偿电压上下限对称
        i_ctrl = u_i_out + RECTIFIER_FEEDFORWARD_GAIN * U_in;               // 叠加0.5倍输入电压前馈
        middle = i_ctrl;                                                    // 同步旧中间变量便于在线观察
        if(U_bus > BUS_CONTROL_MIN_VOLTAGE) v_dc_bus = U_bus;               // 正常时使用实时母线电压完成调制解耦
        else v_dc_bus = BUS_CONTROL_MIN_VOLTAGE;                            // 母线过低时使用5V下限避免除零
        Di = i_ctrl / v_dc_bus;                                             // 把桥侧电压指令归一化为单极性调制量
        if(Di > RECTIFIER_MODULATION_LIMIT) Di = RECTIFIER_MODULATION_LIMIT; // 保留原正向调制限幅
        else if(Di < -RECTIFIER_MODULATION_LIMIT) Di = -RECTIFIER_MODULATION_LIMIT; // 保留原负向调制限幅
        D1 = 0.5f * (1.0f + Di);                                            // ePWM4左桥臂占空比采用(1+Di)/2
        EPwm4Regs.CMPA.bit.CMPA = (Uint16)(RECTIFIER_EPWM_TBPRD * D1);        // 更新整流左桥臂中心对齐比较值（10kHz载波）
        EPwm5Regs.CMPA.bit.CMPA = (Uint16)(RECTIFIER_EPWM_TBPRD * 0.5f * (1.0f - Di)); // 更新整流右桥臂中心对齐比较值（10kHz载波，差模等效20kHz）
        PWM_ReleaseRectifier();                                             // 独立完成ePWM4/5预装等待和Trip释放
    }
    else
    {
        PWM_TripRectifier();                                                // 非主动整流状态始终保持ePWM4/5 Trip关断
        pll_out = 0.0f;                                                     // 关断主动整流后清零瞬时电流参考观察量
        D1 = 0.5f;                                                          // 显示占空比恢复到中点
        middle = 0.0f;                                                      // 清零整流电流环中间量
        i_l_ref = 0.0f;                                                     // 清零整流瞬时电流参考
        err_i = 0.0f;                                                       // 清零整流比例电流误差
        u_i_out = 0.0f;                                                     // 清零整流比例控制输出
        i_ctrl = 0.0f;                                                      // 清零整流桥侧电压指令
        Di = 0.0f;                                                          // 清零整流差模调制量
        pid2.ref = 0.0f;                                                    // 清零停机状态下的PID2参考
        pid2.Xin = 0.0f;                                                    // 清零停机状态下的PID2输入
        pid2.Err = 0.0f;                                                    // 清零停机状态下的PID2误差
        pid2.Integral = 0.0f;                                               // 清零停机状态下的PID2积分
        pid2.result = 0.0f;                                                 // 清零停机状态下的PID2输出
    }

    if(output_freq_actual_hz < output_freq_target_hz)                       // 升频时按固定斜率逐拍逼近目标值
    {
        output_freq_actual_hz += OUTPUT_FREQ_RAMP_STEP_HZ;                  // 20kHz下30Hz频差约0.993秒完成
        if(output_freq_actual_hz > output_freq_target_hz)                   // 最后一拍避免浮点步进越过目标值
            output_freq_actual_hz = output_freq_target_hz;                  // 精确停在30Hz或60Hz目标值
    }
    else if(output_freq_actual_hz > output_freq_target_hz)                  // 降频时保持相同的30Hz/s斜率
    {
        output_freq_actual_hz -= OUTPUT_FREQ_RAMP_STEP_HZ;                  // 每拍降低0.00151Hz并保持相位连续
        if(output_freq_actual_hz < output_freq_target_hz)                   // 最后一拍避免低于目标值
            output_freq_actual_hz = output_freq_target_hz;                  // 精确停在30Hz或60Hz目标值
    }

