lululu-913/F280049_AC-DC-AC_26competition/controller.c
//******************* PIDa：三相输出电压环 *******************//
void PIDa_Init(void)                                                        // 初始化逆变输出电压控制参数
{
    pida.Xin = 0;                                                           // 初始化或更新控制器测量输入
    pida.ref = 0;                                                           // 初始化控制器参考值
    pida.Err = 0;                                                           // 计算或清零当前控制误差
    pida.Err_last = 0;                                                      // 保存或清零上一拍误差
    pida.Kp = INVERTER_VOLTAGE_KP;                                            // 从集中宏读取逆变电压环比例增益
    pida.Ki = INVERTER_VOLTAGE_KI;                                            // 从集中宏读取逆变电压环积分增益
    pida.result = 0;                                                        // 计算或清零控制器当前输出
}

float PIDa_Cal(float u)                                                     // 计算逆变调制分母增量
{
    pida.Xin = u;                                                           // 初始化或更新控制器测量输入
    pida.Err = pida.Xin - pida.ref;                                         // 计算或清零当前控制误差
    pida.result = pida.Kp * (pida.Err - pida.Err_last) + pida.Ki * pida.Err; // 计算或清零控制器当前输出
    pida.Err_last = pida.Err;                                               // 保存或清零上一拍误差
    if(fabsf(pida.Err) > INVERTER_VOLTAGE_ERROR_DEADBAND) return pida.result;                         // 输出误差超出死区时返回调节增量
    return 0;                                                               // 误差位于死区时返回零增量
}

//******************* OLED显示 *******************//
void OLED_output(void)                                                      // 刷新设定值和测量值显示
{
    float oled_bus_value;                                                   // 保存本次刷新使用的实时母线电压快照
    float oled_out_value;                                                   // 保存本次刷新使用的三相输出电压快照
    float oled_di_value;                                                    // 保存本次刷新使用的整流调制量快照
    DINT;                                                                   // 短暂屏蔽ISR，保证三个32位浮点快照内部一致
    oled_bus_value = U_bus;                                                 // 获取实时母线电压供全部模式统一显示
    oled_out_value = U_av;                                                  // 获取实时三相输出等效相电压供全部模式统一显示
    oled_di_value = Di;                                                     // 只读取一次Di，避免符号和幅值来自不同控制周期
    EINT;                                                                   // 快照完成后立即恢复控制中断
    if(oled_bus_value < 0.0f) oled_bus_value = 0.0f;                        // 钳除零点偏差产生的负母线显示值
    if(oled_out_value < 0.0f) oled_out_value = 0.0f;                        // 防止异常负数进入不支持负数的OLED浮点函数
    if(oled_bus_value > 99.0f) oled_bus_value = 99.0f;                      // 限制显示范围以避免超过固定字符区域
    if(oled_out_value > 99.0f) oled_out_value = 99.0f;                      // 限制输出显示范围以保持四行布局稳定

    switch(oled_row)                                                        // 每次调用只刷新一行以降低后台OLED通信占用
    {
        case 0:                                                             // 第0行分别显示整流命令、逆变命令、故障和调制分母
            OLED_ShowNum(1, 0, rectifier_enable, 1);                        // R后显示主动整流命令0或1
            OLED_ShowNum(4, 0, inverter_enable, 1);                         // I后显示逆变运行命令0或1
            OLED_ShowNum(7, 0, flag, 1);                                    // F后显示当前故障码0、1或2
            OLED_ShowFloat(10, 0, M, 3);                                    // M后显示逆变当前调制分母
            break;                                                          // 本次单行刷新结束

        case 1:                                                             // 第1行显示母线参考和母线实测值
            OLED_ShowFloat(3, 1, U_BUS_REF, 3);                             // BR后显示母线电压参考值
            OLED_ShowFloat(10, 1, oled_bus_value, 3);                       // B后显示当前母线实时采样值
            break;                                                          // 本次单行刷新结束

        case 2:                                                             // 第2行显示输出参考和输出实测值
            OLED_ShowFloat(3, 2, U_OUT_REF, 3);                             // OR后显示三相输出相电压参考值
            OLED_ShowFloat(10, 2, oled_out_value, 3);                       // O后显示当前三相输出等效相电压
            break;                                                          // 本次单行刷新结束

        default:                                                            // 第3行显示输出频率和按键步进模式
            OLED_ShowChar(0, 3, 'F');                                        // 频率标签
            OLED_ShowNum(1, 3, (int)(output_freq_actual_hz + 0.5f), 2);     // 显示30或60
            OLED_ShowChar(4, 3, 'M');                                        // 步进模式标签
            OLED_ShowNum(5, 3, step_mode, 1);                               // 0=母线调压，1=输出调压
            break;                                                          // 本次单行刷新结束
    }

    oled_row++;                                                             // 下一次刷新下一行
    if(oled_row >= 4) oled_row = 0;                                         // 第3行完成后回到第0行循环刷新
}

//******************* 按键控制 *******************//
void KEY_Control(int key_value)                                             // 根据按键修改模式或参考值
{
    switch(key_value)                                                       // 根据按键码选择对应操作
    {
        case KEY1_PRESS:                                                    // KEY1切换步进模式
            step_mode = (step_mode == 0) ? 1 : 0;                           // 0=母线调压(母线±0.5V)，1=输出调压(输出±0.1V)
            break;                                                          // 结束当前按键分支

        case KEY2_PRESS:                                                    // KEY2在60Hz与30Hz之间来回切换
            if(output_freq_target_hz >= OUTPUT_FREQ_HIGH_HZ)                // 当前目标为60Hz
                output_freq_target_hz = OUTPUT_FREQ_LOW_HZ;                 // 切换为30Hz
            else                                                            // 当前目标为30Hz
                output_freq_target_hz = OUTPUT_FREQ_HIGH_HZ;                // 切换为60Hz
            break;                                                          // 结束当前按键分支

        case KEY3_PRESS:                                                    // KEY3切换主动整流，并联锁保证逆变先启动
            if(rectifier_enable == 0)                                       // 当前处于被动整流或整流Trip状态
            {
                if(U_bus < BUS_OVERVOLTAGE_LIMIT)                           // 母线已经退出过压区才允许重新确认启动
                {
                    system_fault = 0;                                       // 同时清除可能存在的预留全局故障锁存
                    rectifier_fault = 0;                                    // 清除整流局部故障锁存
                    inverter_enable = 1;                                    // KEY3同时保证先提出逆变运行请求
                    rectifier_enable = 1;                                   // 请求整流等待逆变PWM正常后再启动ePWM4/5
                    flag = 0;                                               // 清除旧故障显示
                }
            }
            else                                                            // 当前主动整流已经处于开启请求
            {
                rectifier_enable = 0;                                       // 撤销主动整流命令但不改变逆变命令
                rectifier_pwm_start_stage = 0;                              // 下次KEY3开启时重新执行CMPA预装
                PWM_TripRectifier();                                        // 本次按键处理当拍立即Trip ePWM4/5
            }
            break;                                                          // 结束当前按键分支

        case KEY4_PRESS:                                                    // KEY4根据step_mode调节目标值
            if(step_mode == 0)
                U_BUS_REF += 0.5f;                                          // 母线调压模式：每次+0.5V
            else
                U_OUT_REF += 0.1f;                                          // 输出调压模式：每次+0.1V
            break;                                                          // 结束当前按键分支

        case KEY5_PRESS:                                                    // KEY5根据step_mode调节目标值
            if(step_mode == 0)
                U_BUS_REF -= 0.5f;                                          // 母线调压模式：每次-0.5V
            else
                U_OUT_REF -= 0.1f;                                          // 输出调压模式：每次-0.1V
            break;                                                          // 结束当前按键分支

