lululu-913/F280049_AC-DC-AC_26competition/controller.c
static void PWM_TripInverter(void)                                          // 只关断逆变侧ePWM1～3并保持整流侧当前状态
{
    EALLOW;                                                                 // 允许访问逆变侧Trip Zone软件触发寄存器
    EPwm1Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断逆变A相A/B输出
    EPwm2Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断逆变B相A/B输出
    EPwm3Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断逆变C相A/B输出
    inverter_pwm_release_wait = 0U;                                         // 每次Trip后重新等待完整PWM周期再释放
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

static void PWM_TripRectifier(void)                                         // 只关断整流侧ePWM4/5并保持逆变侧当前状态
{
    EALLOW;                                                                 // 允许访问整流侧Trip Zone软件触发寄存器
    EPwm4Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断整流左桥臂A/B输出
    EPwm5Regs.TZFRC.bit.OST = 1;                                            // 立即锁存关断整流右桥臂A/B输出
    rectifier_pwm_release_wait = 0U;                                        // 每次Trip后重新等待10kHz整流CMPA完成归零装载
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

static void PWM_ReleaseInverter(void)                                       // 按逆变独立启动阶段释放ePWM1～3
{
    EALLOW;                                                                 // 允许访问逆变侧Trip Zone清除与软件触发寄存器
    if(inverter_pwm_start_stage == 1)                                       // 第一拍仅把三相计算值写入CMPA影子寄存器
    {
        inverter_pwm_release_wait = 0U;                                     // 从CMPA预装完成时开始计算等待拍数
        inverter_pwm_start_stage = 2;                                       // 等待一个完整20kHz PWM周期后再释放Trip
    }
    else if(inverter_pwm_start_stage == 2)                                  // CMPA预装后等待一个完整逆变PWM周期
    {
        if(inverter_pwm_release_wait < INVERTER_PWM_RELEASE_WAIT_ISR)        // 使用饱和计数避免等待变量回绕
            inverter_pwm_release_wait++;                                    // 20kHz ISR累计两拍即100us
        if(inverter_pwm_release_wait >= INVERTER_PWM_RELEASE_WAIT_ISR)       // 确认已跨过一次20kHz载波归零装载
        {
            EPwm1Regs.TZCLR.bit.OST = 1;                                    // 解除逆变A相One-Shot Trip关断锁存
            EPwm2Regs.TZCLR.bit.OST = 1;                                    // 解除逆变B相One-Shot Trip关断锁存
            EPwm3Regs.TZCLR.bit.OST = 1;                                    // 解除逆变C相One-Shot Trip关断锁存
            inverter_pwm_start_stage = 3;                                   // 标记三相逆变PWM已经进入正常运行阶段
        }
    }
    else if(inverter_pwm_start_stage != 3)                                  // 非法阶段值下不允许逆变桥输出
    {
        EPwm1Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持逆变A相关断
        EPwm2Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持逆变B相关断
        EPwm3Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持逆变C相关断
    }
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

static void PWM_ReleaseRectifier(void)                                      // 按整流独立启动阶段释放ePWM4/5
{
    EALLOW;                                                                 // 允许访问整流侧Trip Zone清除与软件触发寄存器
    if(rectifier_pwm_start_stage == 1)                                      // 第一拍仅把整流计算值写入CMPA影子寄存器
    {
        rectifier_pwm_release_wait = 0U;                                    // 从CMPA预装完成时开始计算等待拍数
        rectifier_pwm_start_stage = 2;                                      // 等待10kHz载波归零装载ePWM4/5比较值
    }
    else if(rectifier_pwm_start_stage == 2)                                 // CMPA预装后等待一个完整10kHz整流PWM周期
    {
        if(rectifier_pwm_release_wait < RECTIFIER_PWM_RELEASE_WAIT_ISR)      // 使用饱和计数避免等待变量回绕
            rectifier_pwm_release_wait++;                                   // 20kHz ISR累计两拍即100us
        if(rectifier_pwm_release_wait >= RECTIFIER_PWM_RELEASE_WAIT_ISR)     // 确认已跨过一次10kHz载波归零装载
        {
            EPwm4Regs.TZCLR.bit.OST = 1;                                    // 解除整流左桥臂One-Shot Trip关断锁存
            EPwm5Regs.TZCLR.bit.OST = 1;                                    // 解除整流右桥臂One-Shot Trip关断锁存
            rectifier_pwm_start_stage = 3;                                  // 标记主动整流PWM已经进入正常运行阶段
        }
    }
    else if(rectifier_pwm_start_stage != 3)                                 // 非法阶段值下不允许主动整流输出
    {
        EPwm4Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持整流左桥臂关断
        EPwm5Regs.TZFRC.bit.OST = 1;                                        // 异常状态保持整流右桥臂关断
    }
    EDIS;                                                                   // 重新禁止访问受保护寄存器
}

//******************* ePWM统一初始化 *******************//
void InitEPWM(void)                                                         // 冻结时基并统一配置所有ePWM模块
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 0;                                   // 冻结全部ePWM时基以便同步配置
    EDIS;                                                                   // 重新禁止访问受保护寄存器

    EPWM1_Init();                                                           // 配置三相逆变A相ePWM
    EPWM2_Init();                                                           // 配置三相逆变B相ePWM
    EPWM3_Init();                                                           // 配置三相逆变C相ePWM，保持20kHz载波并提供20kHz ADC SOCA
    EPWM4_Init();                                                           // 配置10kHz单相整流左桥臂ePWM
    EPWM5_Init();                                                           // 配置10kHz单相整流右桥臂ePWM，差模等效20kHz
    PWM_ForceAllLow();                                                      // 立即将所有ePWM输出强制为低电平
}

void EPWM1_Init(void)                                                       // 初始化ePWM1
{
    EALLOW;                                                                 // 允许访问受保护寄存器
    CpuSysRegs.PCLKCR2.bit.EPWM1 = 1;                                       // 打开对应ePWM模块外设时钟
    EPwm1Regs.TZCTL.bit.TZA = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM1A为低
    EPwm1Regs.TZCTL.bit.TZB = TZ_FORCE_LO;                                  // One-Shot Trip发生时从死区模块之后强制ePWM1B为低
    EPwm1Regs.TZFRC.bit.OST = 1;                                            // 初始化期间立即锁存关断ePWM1输出
    EDIS;                                                                   // 重新禁止访问受保护寄存器
    EPwm1Regs.AQSFRC.bit.RLDCSF = 3;                                        // AQ连续软件强制使用立即模式，仅用于清除可能残留的旧状态
    EPwm1Regs.AQCSFRC.bit.CSFA = 0;                                         // 禁用旧的ePWM1A AQ连续软件强制
    EPwm1Regs.AQCSFRC.bit.CSFB = 0;                                         // 禁用旧的ePWM1B AQ连续软件强制

